# coding=utf-8
from __future__ import unicode_literals

MAGAZINES_CHOICES = (
    ('IM', 'Игромания'),
)

YEAR_CHOICES = (
    (1997, 1997),
    (1998, 1998),
    (1999, 1999),
    (2000, 2000),
    (2001, 2001),
    (2002, 2002),
    (2003, 2003),
    (2004, 2004),
    (2005, 2005),
    (2006, 2006),
    (2007, 2007),
    (2008, 2008),
    (2009, 2009),
    (2010, 2010),
    (2011, 2011),
    (2012, 2012),
    (2013, 2013),
    (2014, 2014),
    (2015, 2015),
    (2016, 2016),
)

MONTH_CHOICES = (
    (1, 'Январь'),
    (2, 'Февраль'),
    (3, 'Март'),
    (4, 'Апрель'),
    (5, 'Май'),
    (6, 'Июнь'),
    (7, 'Июль'),
    (8, 'Август'),
    (9, 'Сентябрь'),
    (10, 'Октябрь'),
    (11, 'Ноябрь'),
    (12, 'Декабрь'),
)

# MONTH_CHOICES = (
#     ('Jan', 'Январь'),
#     ('Feb ', 'Февраль'),
#     ('Mar', 'Март'),
#     ('Apr', 'Апрель'),
#     ('May', 'Май'),
#     ('June', 'Июнь'),
#     ('July', 'Июль'),
#     ('Aug', 'Август'),
#     ('Sept', 'Сентябрь'),
#     ('Oct ', 'Октябрь'),
#     ('Nov', 'Ноябрь'),
#     ('Dec', 'Декабрь'),
# )
